from database import add_shop, find_shops_by_name, get_all_shops

test_shops = [
    ("Пятёрочка", "ул. Марии Ульяновой, 10", 55.681270885968615, 37.52501075649068),
    ("Пятёрочка", "ул. Коштоянца, 21А", 55.67787004841791, 37.48984163188669),
    ("Пятёрочка", "пр. Вернадского, 15", 55.68593668567613, 37.52423203237901),
    ("Магнит", "ул. Кравченко, 18", 55.679179, 37.514913),
    ("Магнит", "пр. Вернадского, 15", 55.685667133717004, 37.52468992394177),
    ("Перекрёсток", "ул. Удальцова, 42", 55.6834489262892, 37.49124366137679),
    ("Перекрёсток", "пр. Вернадского, 86А", 55.663024, 37.481001),
    ("Ашан", "пр. Вернадского, 6", 55.69253265154435, 37.5276324060817),
    ("ВкусВилл", "пр. Вернадского, 39", 55.675104979312266, 37.50505631150001),
    ("ВкусВилл", "ул. Удальцова, 65", 55.678939626713536, 37.5009264160076)
]

existing = [s.name for s in get_all_shops()]

for name, address, lat, lon in test_shops:
    if name not in existing:
        add_shop(name, address, lat, lon)
        print(f"Добавлен: {name} - {address}")
    else:
        print(f"Уже есть: {name}")

print(f"\nВсего магазинов в базе: {len(get_all_shops())}")